# HasStripedRows Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSchedule..::..HasStripedRows Property
ViewSchedule Class See Also
---
Indicates whether this schedule has striped rows.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public bool HasStripedRows { get; set; }
```

Visual Basic
---
```text
Public Property HasStripedRows As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool HasStripedRows {
	bool get ();
	void set (bool value);
}
```

# Remarks
Striped rows can be overridden by shading or conditional formatting.
# See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace